Digid0t/DigiDot_6/ESP32_CAM_Professional_v3.1.ino
/*
 * ==========================================
 * ESP32-CAM PROFESSIONAL WebServer
 * FINAL VERSION - ALLE BOARD VERSIONEN
 * ==========================================
 * 
 * FEATURES:
 * - Kompatibel mit ESP32 Board Version 2.x UND 3.x
 * - Dual-Mode: WLAN-Client ODER Access Point (automatischer Fallback)
 * - HTTP Basic Authentication (Passwortschutz)
 * - Live-Video-Stream (MJPEG)
 * - Foto-Aufnahme und Speicherung auf SD-Karte
 * - Robuste Fehlerbehandlung
 * - Status-LED Anzeigen
 * - Automatische Wiederverbindung
 * 
 * HARDWARE:
 * - ESP32-CAM (AI-Thinker)
 * - MicroSD-Karte (optional für Foto-Speicherung)
 * 
 * BOARD-EINSTELLUNGEN:
 * - Board: "AI Thinker ESP32-CAM"
 * - Upload Speed: 115200
 * - Partition Scheme: "Huge APP (3MB No OTA/1MB SPIFFS)"
 * 
 * Version: 3.1 Final (Board Version 2.x & 3.x kompatibel)
 * Datum: 2025-11-05
 * Status: Production Ready
 * ==========================================
 */

#include "esp_camera.h"
#include "esp_timer.h"
#include "img_converters.h"
#include "Arduino.h"
#include "fb_gfx.h"
#include "soc/soc.h"
#include "soc/rtc_cntl_reg.h"
#include "esp_http_server.h"
#include <WiFi.h>
#include "FS.h"
#include "SD_MMC.h"

// ===== KONFIGURATION =====

// WLAN-Client-Modus (verbindet sich mit bestehendem WLAN)
const char* WIFI_SSID = "Wilde_Hilde";              // Dein WLAN-Name
const char* WIFI_PASSWORD = "weildubistgeil0815";   // Dein WLAN-Passwort

// Access Point Modus (Fallback wenn WLAN nicht erreichbar)
const char* AP_SSID = "ESP32-CAM-Wilde";            // Name des ESP32-CAM AP
const char* AP_PASSWORD = "weildubistgeil0815";              // AP-Passwort (min. 8 Zeichen!)

// Webserver Authentifizierung
const char* HTTP_USERNAME = "moni";                // Web-Login Benutzername
const char* HTTP_PASSWORD = "weildubistgeil0815";            // Web-Login Passwort

// Timeout-Einstellungen
#define WIFI_CONNECT_TIMEOUT 20000  // 20 Sekunden Timeout für WLAN-Verbindung

// ===== KAMERA PIN DEFINITIONEN (AI-Thinker ESP32-CAM) =====
#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27
#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22
#define LED_GPIO_NUM       4

// ===== GLOBALE VARIABLEN =====
httpd_handle_t camera_httpd = NULL;
httpd_handle_t stream_httpd = NULL;
bool sd_card_available = false;
int photo_counter = 0;
bool is_access_point_mode = false;
unsigned long last_wifi_check = 0;

// LED-Kanal für beide Board-Versionen
#define LED_CHANNEL 7

// ===== HILFSFUNKTIONEN =====

/*
 * LED-Flash Steuerung
 * Kompatibel mit ESP32 Board Version 2.x und 3.x
 */
void setupLedFlash(int pin) {
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // Neue API für ESP32 Board Version 3.x
    ledcAttach(pin, 5000, 8);
    ledcWrite(pin, 0);
    Serial.println("[LED] Flash initialisiert (Board v3.x)");
  #else
    // Alte API für ESP32 Board Version 2.x
    ledcSetup(LED_CHANNEL, 5000, 8);
    ledcAttachPin(pin, LED_CHANNEL);
    ledcWrite(LED_CHANNEL, 0);
    Serial.println("[LED] Flash initialisiert (Board v2.x)");
  #endif
}

void setLedBrightness(int brightness) {
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    // Neue API für ESP32 Board Version 3.x
    ledcWrite(LED_GPIO_NUM, brightness);
  #else
    // Alte API für ESP32 Board Version 2.x
    ledcWrite(LED_CHANNEL, brightness);
  #endif
}

/*
 * Base64 Encoding (für HTTP Auth)
 * Einfache Implementation ohne externe Bibliothek
 */
String base64_encode(String input) {
  const char* base64_chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  String output = "";
  int val = 0;
  int valb = -6;
  
  for (unsigned char c : input) {
    val = (val << 8) + c;
    valb += 8;
    while (valb >= 0) {
      output += base64_chars[(val >> valb) & 0x3F];
      valb -= 6;
    }
  }
  if (valb > -6) {
    output += base64_chars[((val << 8) >> (valb + 8)) & 0x3F];
  }
  while (output.length() % 4) {
    output += '=';
  }
  return output;
}

String base64_decode(String input) {
  const char* base64_chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/";
  String output = "";
  int T[256];
  
  for (int i = 0; i < 256; i++) T[i] = -1;
  for (int i = 0; i < 64; i++) T[(int)base64_chars[i]] = i;
  
  int val = 0;
  int valb = -8;
  
  for (unsigned char c : input) {
    if (T[c] == -1) break;
    val = (val << 6) + T[c];
    valb += 6;
    if (valb >= 0) {
      output += char((val >> valb) & 0xFF);
      valb -= 8;
    }
  }
  return output;
}

/*
 * HTTP Basic Authentication Check
 */
bool checkAuthentication(httpd_req_t *req) {
  char auth_header[128];
  size_t auth_len = httpd_req_get_hdr_value_len(req, "Authorization");
  
  if (auth_len > 0 && auth_len < sizeof(auth_header)) {
    if (httpd_req_get_hdr_value_str(req, "Authorization", auth_header, sizeof(auth_header)) == ESP_OK) {
      if (strncmp(auth_header, "Basic ", 6) == 0) {
        String auth_b64 = String(auth_header + 6);
        String decoded = base64_decode(auth_b64);
        String expected = String(HTTP_USERNAME) + ":" + String(HTTP_PASSWORD);
        
        if (decoded == expected) {
          return true;
        }
      }
    }
  }
  return false;
}

esp_err_t sendAuthRequired(httpd_req_t *req) {
  httpd_resp_set_status(req, "401 Unauthorized");
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "WWW-Authenticate", "Basic realm=\"ESP32-CAM\"");
  
  const char* resp = "<html><body><h1>401 Unauthorized</h1><p>Bitte anmelden.</p></body></html>";
  httpd_resp_send(req, resp, strlen(resp));
  return ESP_OK;
}

/*
 * SD-Karte initialisieren
 */
bool initSDCard() {
  Serial.println("[SD] Initialisiere SD-Karte...");
  
