Digid0t/DigiDot_6/ESP32_CAM_Professional_v3.1.ino
  if (!SD_MMC.begin("/sdcard", true)) {
    Serial.println("[SD] WARNUNG: SD-Karte nicht gefunden");
    Serial.println("[SD] Fotos können nicht gespeichert werden");
    return false;
  }
  
  uint8_t cardType = SD_MMC.cardType();
  if (cardType == CARD_NONE) {
    Serial.println("[SD] Keine SD-Karte eingelegt");
    return false;
  }
  
  Serial.print("[SD] ✓ SD-Karte Typ: ");
  if (cardType == CARD_MMC) Serial.println("MMC");
  else if (cardType == CARD_SD) Serial.println("SDSC");
  else if (cardType == CARD_SDHC) Serial.println("SDHC");
  else Serial.println("UNKNOWN");
  
  uint64_t cardSize = SD_MMC.cardSize() / (1024 * 1024);
  Serial.printf("[SD] Größe: %lluMB\n", cardSize);
  
  if (!SD_MMC.exists("/photos")) {
    if (SD_MMC.mkdir("/photos")) {
      Serial.println("[SD] Ordner '/photos' erstellt");
    }
  }
  
  File counterFile = SD_MMC.open("/photo_counter.txt", FILE_READ);
  if (counterFile) {
    String counter_str = counterFile.readStringUntil('\n');
    photo_counter = counter_str.toInt();
    counterFile.close();
    Serial.printf("[SD] Letzter Foto-Counter: %d\n", photo_counter);
  }
  
  return true;
}

/*
 * Foto auf SD-Karte speichern
 */
bool savePhoto() {
  if (!sd_card_available) {
    Serial.println("[FOTO] FEHLER: SD-Karte nicht verfügbar");
    return false;
  }
  
  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[FOTO] FEHLER: Kamera-Frame konnte nicht erfasst werden");
    return false;
  }
  
  setLedBrightness(255);
  delay(100);
  setLedBrightness(0);
  
  photo_counter++;
  char filename[32];
  snprintf(filename, sizeof(filename), "/photos/photo_%04d.jpg", photo_counter);
  
  File file = SD_MMC.open(filename, FILE_WRITE);
  if (!file) {
    Serial.printf("[FOTO] FEHLER: Konnte Datei nicht öffnen: %s\n", filename);
    esp_camera_fb_return(fb);
    return false;
  }
  
  file.write(fb->buf, fb->len);
  file.close();
  esp_camera_fb_return(fb);
  
  File counterFile = SD_MMC.open("/photo_counter.txt", FILE_WRITE);
  if (counterFile) {
    counterFile.println(photo_counter);
    counterFile.close();
  }
  
  Serial.printf("[FOTO] ✓ Foto gespeichert: %s\n", filename);
  return true;
}

// ===== HTTP HANDLER =====

#define PART_BOUNDARY "123456789000000000000987654321"
static const char* STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char* STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char* STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";

static esp_err_t stream_handler(httpd_req_t *req) {
  if (!checkAuthentication(req)) {
    return sendAuthRequired(req);
  }
  
  camera_fb_t* fb = NULL;
  esp_err_t res = ESP_OK;
  size_t jpg_buf_len = 0;
  uint8_t* jpg_buf = NULL;
  char part_buf[64];
  
  res = httpd_resp_set_type(req, STREAM_CONTENT_TYPE);
  if (res != ESP_OK) return res;
  
  Serial.println("[STREAM] Client verbunden");
  
  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      Serial.println("[STREAM] Kamera-Frame-Fehler");
      res = ESP_FAIL;
      break;
    }
    
    if (fb->format != PIXFORMAT_JPEG) {
      bool jpeg_converted = frame2jpg(fb, 80, &jpg_buf, &jpg_buf_len);
      esp_camera_fb_return(fb);
      fb = NULL;
      if (!jpeg_converted) {
        Serial.println("[STREAM] JPEG-Konvertierung fehlgeschlagen");
        res = ESP_FAIL;
        break;
      }
    } else {
      jpg_buf_len = fb->len;
      jpg_buf = fb->buf;
    }
    
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, STREAM_BOUNDARY, strlen(STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf(part_buf, 64, STREAM_PART, jpg_buf_len);
      res = httpd_resp_send_chunk(req, part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char*)jpg_buf, jpg_buf_len);
    }
    
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      jpg_buf = NULL;
    } else if (jpg_buf) {
      free(jpg_buf);
      jpg_buf = NULL;
    }
    
    if (res != ESP_OK) break;
  }
  
  Serial.println("[STREAM] Client getrennt");
  return res;
}

static esp_err_t capture_handler(httpd_req_t *req) {
  if (!checkAuthentication(req)) {
    return sendAuthRequired(req);
  }
  
  Serial.println("[CAPTURE] Einzelbild wird aufgenommen");
  
  camera_fb_t* fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[CAPTURE] Kamera-Frame-Fehler");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  
  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  
  esp_err_t res = httpd_resp_send(req, (const char*)fb->buf, fb->len);
  esp_camera_fb_return(fb);
  
  if (res == ESP_OK) {
    Serial.println("[CAPTURE] ✓ Einzelbild gesendet");
  }
  
  return res;
}

static esp_err_t save_photo_handler(httpd_req_t *req) {
  if (!checkAuthentication(req)) {
    return sendAuthRequired(req);
  }
  
  bool success = savePhoto();
  
  httpd_resp_set_type(req, "application/json");
  if (success) {
    char response[128];
    snprintf(response, sizeof(response), 
             "{\"success\":true,\"message\":\"Foto gespeichert\",\"filename\":\"photo_%04d.jpg\",\"count\":%d}", 
             photo_counter, photo_counter);
    httpd_resp_send(req, response, strlen(response));
  } else {
    const char* response = "{\"success\":false,\"message\":\"Fehler beim Speichern\"}";
    httpd_resp_send(req, response, strlen(response));
  }
  
  return ESP_OK;
}

static esp_err_t status_handler(httpd_req_t *req) {
  if (!checkAuthentication(req)) {
    return sendAuthRequired(req);
  }
  
  char response[512];
  snprintf(response, sizeof(response),
           "{\"mode\":\"%s\",\"ssid\":\"%s\",\"ip\":\"%s\",\"rssi\":%d,\"sd_card\":%s,\"photos\":%d,\"heap\":%d}",
           is_access_point_mode ? "AP" : "Client",
           is_access_point_mode ? AP_SSID : WIFI_SSID,
           WiFi.localIP().toString().c_str(),
           WiFi.RSSI(),
           sd_card_available ? "true" : "false",
           photo_counter,
           ESP.getFreeHeap());
  
  httpd_resp_set_type(req, "application/json");
  httpd_resp_send(req, response, strlen(response));
  return ESP_OK;
}

static esp_err_t index_handler(httpd_req_t *req) {
  if (!checkAuthentication(req)) {
    return sendAuthRequired(req);
  }
  
