Digid0t/DigiDot_6/ESP32_CAM_Professional_v3.1.ino
  Serial.println("[WEB] Hauptseite wird geladen");
  
  const char* html = R"rawliteral(
<!DOCTYPE html>
<html lang="de">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ESP32-CAM Wilde Hilde</title>
    <style>
        * { margin: 0; padding: 0; box-sizing: border-box; }
        body {
            font-family: Arial, sans-serif;
            background: linear-gradient(135deg, #1a1a1a 0%, #2d2d2d 100%);
            color: #fff;
            padding: 20px;
        }
        .container {
            max-width: 1200px;
            margin: 0 auto;
            background: rgba(255, 255, 255, 0.05);
            border-radius: 20px;
            padding: 30px;
            backdrop-filter: blur(10px);
        }
        h1 {
            text-align: center;
            color: #00ff88;
            margin-bottom: 30px;
            text-shadow: 0 0 20px rgba(0, 255, 136, 0.5);
        }
        .status {
            background: rgba(0, 255, 136, 0.1);
            padding: 15px;
            border-radius: 10px;
            margin-bottom: 20px;
            border: 1px solid rgba(0, 255, 136, 0.3);
        }
        .video-container {
            position: relative;
            width: 100%;
            background: #000;
            border-radius: 15px;
            overflow: hidden;
            margin-bottom: 20px;
        }
        .video-container img {
            width: 100%;
            height: auto;
            display: block;
        }
        .controls {
            display: grid;
            grid-template-columns: repeat(auto-fit, minmax(200px, 1fr));
            gap: 15px;
            margin-top: 20px;
        }
        button {
            padding: 15px 25px;
            font-size: 16px;
            font-weight: 600;
            color: #000;
            background: linear-gradient(135deg, #00ff88 0%, #00cc6f 100%);
            border: none;
            border-radius: 10px;
            cursor: pointer;
            transition: all 0.3s ease;
            box-shadow: 0 4px 15px rgba(0, 255, 136, 0.3);
        }
        button:hover {
            transform: translateY(-2px);
            box-shadow: 0 6px 20px rgba(0, 255, 136, 0.4);
        }
        button:active {
            transform: translateY(0);
        }
        .info {
            background: rgba(255, 255, 255, 0.03);
            padding: 20px;
            border-radius: 10px;
            margin-top: 20px;
        }
        .info-row {
            display: flex;
            justify-content: space-between;
            padding: 8px 0;
            border-bottom: 1px solid rgba(255, 255, 255, 0.1);
        }
        .info-row:last-child { border-bottom: none; }
        .label { color: #888; }
        .value { color: #00ff88; font-weight: bold; }
        #notification {
            position: fixed;
            top: 20px;
            right: 20px;
            padding: 15px 25px;
            background: #00ff88;
            color: #000;
            border-radius: 10px;
            font-weight: bold;
            display: none;
            animation: slideIn 0.3s ease;
        }
        @keyframes slideIn {
            from { transform: translateX(400px); opacity: 0; }
            to { transform: translateX(0); opacity: 1; }
        }
    </style>
</head>
<body>
    <div class="container">
        <h1>📹 ESP32-CAM Wilde Hilde</h1>
        
        <div class="status" id="status">
            <strong>Status:</strong> <span id="statusText">Lädt...</span>
        </div>
        
        <div class="video-container">
            <img id="stream" src="/stream" alt="Video Stream">
        </div>
        
        <div class="controls">
            <button onclick="reloadStream()">🔄 Stream Neu Laden</button>
            <button onclick="capturePhoto()">📸 Foto Anzeigen</button>
            <button onclick="savePhoto()">💾 Foto Speichern</button>
            <button onclick="updateStatus()">ℹ️ Status Aktualisieren</button>
        </div>
        
        <div class="info" id="info">
            <h3 style="color: #00ff88; margin-bottom: 15px;">System-Information</h3>
            <div class="info-row">
                <span class="label">Modus:</span>
                <span class="value" id="mode">-</span>
            </div>
            <div class="info-row">
                <span class="label">SSID:</span>
                <span class="value" id="ssid">-</span>
            </div>
            <div class="info-row">
                <span class="label">IP-Adresse:</span>
                <span class="value" id="ip">-</span>
            </div>
            <div class="info-row">
                <span class="label">Signal:</span>
                <span class="value" id="rssi">-</span>
            </div>
            <div class="info-row">
                <span class="label">SD-Karte:</span>
                <span class="value" id="sdcard">-</span>
            </div>
            <div class="info-row">
                <span class="label">Gespeicherte Fotos:</span>
                <span class="value" id="photos">-</span>
            </div>
            <div class="info-row">
                <span class="label">Freier Speicher:</span>
                <span class="value" id="heap">-</span>
            </div>
        </div>
    </div>
    
    <div id="notification"></div>
    
    <script>
        function showNotification(message) {
            const notif = document.getElementById('notification');
            notif.textContent = message;
            notif.style.display = 'block';
            setTimeout(() => { notif.style.display = 'none'; }, 3000);
        }
        
        function reloadStream() {
            document.getElementById('stream').src = '/stream?' + new Date().getTime();
            showNotification('Stream wird neu geladen...');
        }
        
        function capturePhoto() {
            window.open('/capture', '_blank');
        }
        
        async function savePhoto() {
            try {
                const response = await fetch('/save_photo');
                const data = await response.json();
                if (data.success) {
                    showNotification('✓ Foto gespeichert: ' + data.filename);
                    updateStatus();
                } else {
                    showNotification('✗ Fehler: ' + data.message);
                }
            } catch (error) {
                showNotification('✗ Fehler beim Speichern');
            }
        }
        
        async function updateStatus() {
            try {
                const response = await fetch('/status');
                const data = await response.json();
                
