Digid0t/DigiDot_6/ESP32_CAM_Professional_v3.1.ino
                document.getElementById('mode').textContent = data.mode;
                document.getElementById('ssid').textContent = data.ssid;
                document.getElementById('ip').textContent = data.ip;
                document.getElementById('rssi').textContent = data.rssi + ' dBm';
                document.getElementById('sdcard').textContent = data.sd_card ? 'Verfügbar ✓' : 'Nicht verfügbar ✗';
                document.getElementById('photos').textContent = data.photos;
                document.getElementById('heap').textContent = (data.heap / 1024).toFixed(1) + ' KB';
                
                document.getElementById('statusText').textContent = '✓ Online - ' + data.mode + ' Modus';
            } catch (error) {
                console.error('Status-Fehler:', error);
            }
        }
        
        document.getElementById('stream').onload = function() {
            document.getElementById('statusText').textContent = '✓ Stream läuft';
        };
        
        document.getElementById('stream').onerror = function() {
            document.getElementById('statusText').textContent = '⚠ Stream-Fehler';
        };
        
        setInterval(updateStatus, 10000);
        setTimeout(updateStatus, 1000);
    </script>
</body>
</html>
)rawliteral";
  
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, html, strlen(html));
}

void startWebServer() {
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.server_port = 80;
  config.ctrl_port = 32768;
  
  httpd_uri_t index_uri = { .uri = "/", .method = HTTP_GET, .handler = index_handler, .user_ctx = NULL };
  httpd_uri_t stream_uri = { .uri = "/stream", .method = HTTP_GET, .handler = stream_handler, .user_ctx = NULL };
  httpd_uri_t capture_uri = { .uri = "/capture", .method = HTTP_GET, .handler = capture_handler, .user_ctx = NULL };
  httpd_uri_t save_photo_uri = { .uri = "/save_photo", .method = HTTP_GET, .handler = save_photo_handler, .user_ctx = NULL };
  httpd_uri_t status_uri = { .uri = "/status", .method = HTTP_GET, .handler = status_handler, .user_ctx = NULL };
  
  Serial.println("[SERVER] Starte HTTP-Server...");
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
    httpd_register_uri_handler(camera_httpd, &save_photo_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    Serial.println("[SERVER] ✓ HTTP-Server gestartet");
  }
  
  config.server_port = 81;
  config.ctrl_port = 32769;
  
  Serial.println("[SERVER] Starte Stream-Server...");
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
    Serial.println("[SERVER] ✓ Stream-Server gestartet");
  }
}

bool initCamera() {
  Serial.println("[KAMERA] Initialisiere Kamera...");
  
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 20000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.frame_size = FRAMESIZE_UXGA;
  config.jpeg_quality = 12;
  config.fb_count = 1;
  config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
  
  if (psramFound()) {
    Serial.println("[KAMERA] PSRAM gefunden - Hohe Qualität aktiviert");
    config.jpeg_quality = 10;
    config.fb_count = 2;
    config.grab_mode = CAMERA_GRAB_LATEST;
    config.fb_location = CAMERA_FB_IN_PSRAM;
  } else {
    Serial.println("[KAMERA] WARNUNG: Kein PSRAM - Reduzierte Qualität");
    config.frame_size = FRAMESIZE_SVGA;
    config.fb_location = CAMERA_FB_IN_DRAM;
  }
  
  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("[KAMERA] ✗ FEHLER: Init fehlgeschlagen mit Error 0x%x\n", err);
    Serial.println("[KAMERA] Bitte ESP32-CAM überprüfen");
    return false;
  }
  
  Serial.println("[KAMERA] ✓ Kamera erfolgreich initialisiert");
  
  sensor_t* s = esp_camera_sensor_get();
  if (s != NULL) {
    s->set_brightness(s, 0);
    s->set_contrast(s, 0);
    s->set_saturation(s, 0);
    s->set_special_effect(s, 0);
    s->set_whitebal(s, 1);
    s->set_awb_gain(s, 1);
    s->set_wb_mode(s, 0);
    s->set_exposure_ctrl(s, 1);
    s->set_aec2(s, 0);
    s->set_gain_ctrl(s, 1);
    s->set_agc_gain(s, 0);
    s->set_gainceiling(s, (gainceiling_t)0);
    s->set_bpc(s, 0);
    s->set_wpc(s, 1);
    s->set_raw_gma(s, 1);
    s->set_lenc(s, 1);
    s->set_hmirror(s, 0);
    s->set_vflip(s, 0);
    s->set_dcw(s, 1);
    s->set_colorbar(s, 0);
    Serial.println("[KAMERA] Sensor-Parameter optimiert");
  }
  
  return true;
}

bool connectToWiFi() {
  Serial.println("========================================");
  Serial.println("[WLAN] Versuche Verbindung herzustellen...");
  Serial.printf("[WLAN] SSID: %s\n", WIFI_SSID);
  
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  WiFi.setSleep(false);
  
  unsigned long start_time = millis();
  int attempt = 0;
  
  while (WiFi.status() != WL_CONNECTED && (millis() - start_time) < WIFI_CONNECT_TIMEOUT) {
    delay(500);
    Serial.print(".");
    setLedBrightness((attempt % 2) * 128);
    attempt++;
    
    if (attempt % 40 == 0) {
      Serial.println();
      Serial.printf("[WLAN] Versuche weiter... (%d Sekunden)\n", (millis() - start_time) / 1000);
    }
  }
  
  Serial.println();
  
  if (WiFi.status() == WL_CONNECTED) {
    setLedBrightness(0);
    Serial.println("[WLAN] ✓ Verbindung erfolgreich!");
    Serial.print("[WLAN] IP-Adresse: ");
    Serial.println(WiFi.localIP());
    Serial.print("[WLAN] Signal-Stärke: ");
    long rssi = WiFi.RSSI();
    Serial.print(rssi);
    Serial.print(" dBm ");
    
