Digid0t/DigiDot_6/ESP32_CAM_Professional_v3.1.ino
    if (rssi > -50) Serial.println("(Ausgezeichnet)");
    else if (rssi > -60) Serial.println("(Sehr gut)");
    else if (rssi > -70) Serial.println("(Gut)");
    else if (rssi > -80) Serial.println("(Schwach)");
    else Serial.println("(Sehr schwach)");
    
    return true;
  } else {
    Serial.println("[WLAN] ✗ Verbindung fehlgeschlagen!");
    return false;
  }
}

void startAccessPoint() {
  Serial.println("========================================");
  Serial.println("[AP] Starte Access Point Modus...");
  Serial.printf("[AP] SSID: %s\n", AP_SSID);
  Serial.printf("[AP] Passwort: %s\n", AP_PASSWORD);
  
  WiFi.mode(WIFI_AP);
  bool success = WiFi.softAP(AP_SSID, AP_PASSWORD);
  
  if (success) {
    IPAddress IP = WiFi.softAPIP();
    Serial.println("[AP] ✓ Access Point gestartet!");
    Serial.print("[AP] IP-Adresse: ");
    Serial.println(IP);
    is_access_point_mode = true;
    
    for (int i = 0; i < 6; i++) {
      setLedBrightness(255);
      delay(200);
      setLedBrightness(0);
      delay(200);
    }
  } else {
    Serial.println("[AP] ✗ FEHLER: Access Point konnte nicht gestartet werden!");
    delay(10000);
    ESP.restart();
  }
}

void setup() {
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
  
  Serial.begin(115200);
  Serial.setDebugOutput(true);
  delay(1000);
  
  Serial.println();
  Serial.println("========================================");
  Serial.println("  ESP32-CAM PROFESSIONAL v3.1");
  Serial.println("  Wilde Hilde Edition");
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  Serial.println("  Board Version: 3.x");
  #else
  Serial.println("  Board Version: 2.x");
  #endif
  Serial.println("========================================");
  Serial.println();
  
  setupLedFlash(LED_GPIO_NUM);
  setLedBrightness(0);
  
  if (!initCamera()) {
    Serial.println("[SYSTEM] KRITISCHER FEHLER: Kamera!");
    while (true) {
      setLedBrightness(255);
      delay(100);
      setLedBrightness(0);
      delay(100);
    }
  }
  
  sd_card_available = initSDCard();
  
  bool wifi_connected = connectToWiFi();
  
  if (!wifi_connected) {
    Serial.println("[SYSTEM] Wechsle zu Access Point Modus...");
    delay(1000);
    startAccessPoint();
  } else {
    is_access_point_mode = false;
  }
  
  startWebServer();
  
  Serial.println("========================================");
  Serial.println("  ✓ ESP32-CAM BEREIT!");
  Serial.println("========================================");
  
  if (is_access_point_mode) {
    Serial.println("  MODUS: Access Point");
    Serial.printf("  SSID: %s\n", AP_SSID);
    Serial.println("  IP: 192.168.4.1");
    Serial.println("  Verbinde mit ESP32-CAM WLAN");
  } else {
    Serial.println("  MODUS: WLAN Client");
    Serial.printf("  Verbunden mit: %s\n", WIFI_SSID);
    Serial.print("  IP: ");
    Serial.println(WiFi.localIP());
    Serial.printf("  Zugriff: http://%s\n", WiFi.localIP().toString().c_str());
  }
  
  Serial.printf("  Login: %s / %s\n", HTTP_USERNAME, HTTP_PASSWORD);
  Serial.printf("  SD-Karte: %s\n", sd_card_available ? "Verfügbar" : "Nicht verfügbar");
  Serial.println("========================================");
}

void loop() {
  if (!is_access_point_mode) {
    unsigned long current_time = millis();
    
    if (current_time - last_wifi_check > 10000) {
      last_wifi_check = current_time;
      
      if (WiFi.status() != WL_CONNECTED) {
        Serial.println("[WLAN] Verbindung verloren! Versuche neu...");
        WiFi.disconnect();
        delay(1000);
        
        bool reconnected = connectToWiFi();
        
        if (!reconnected) {
          Serial.println("[WLAN] Wechsle zu AP-Modus...");
          
          if (camera_httpd) {
            httpd_stop(camera_httpd);
            camera_httpd = NULL;
          }
          if (stream_httpd) {
            httpd_stop(stream_httpd);
            stream_httpd = NULL;
          }
          
          startAccessPoint();
          startWebServer();
        }
      }
    }
  }
  
  delay(100);
}
